app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
  if @book.save
    redirect_to book_path(@book.id)
    flash.notice = "新規投稿に成功しました"
  else
    @books = Book.all
---
INSERT INTO "books" ("created_at", "updated_at", "title", "body") VALUES (?, ?, ?, ?)  [["created_at", "2022-10-03 16:44:20.026830"], ["updated_at", "2022-10-03 16:44:20.026830"], ["title", "投稿すると"], ["body", "表示されます"]]
SELECT "books".* FROM "books"

  def update
    @book = Book.find(params[:id])
   if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
UPDATE "books" SET "updated_at" = ?, "title" = ?, "body" = ? WHERE "books"."id" = ?  [["updated_at", "2022-10-06 08:43:06.232848"], ["title", "投稿すると"], ["body", "iii"], ["id", 28]]